CREATE table Movies_list(
MovieId int,
Title varchar(255),
Genre varchar(255),
Director varchar(255),
Kinopoisk float,
IMDB float,
Release_Year smallint
);


Insert INTO movies_list(movieid, title, duration, genre, director, kinopoisk, imdb, release_year)
VALUES (1,'Властелин колец. Братство кольца', 178, 'Фэнтези', 'Питер Джексон', 8.6, 8.80, 2001),
	   (2,'Властелин колец. Две крепости', 179, 'Фэнтези', 'Питер Джексон', 8.6, 8.80, 2002),
	   (3,'Властелин колец. Возвращение короля', 201, 'Фэнтези', 'Питер Джексон', 8.7, 9.0, 2003),
	   (4,'Матрица', 136, 'Фантастика, боевик', 'Вачовски', 8.5, 8.7, 1999),
	   (5,'Матрица. Перезагрузка', 138, 'Фантастика, боевик', 'Вачовски', 7.7, 7.2, 2003),
	   (6,'Матрица. Революция', 129, 'Фантастика, боевик', 'Вачовски', 7.6, 6.7, 2003),
	   (7,'Унесённые ветром', 222, 'мелодрама, история, драма', 'Виктор Флеминг, Джордж Кьюкор, Сэм Вуд', 8.4, 8.2, 1939)
